betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_ddl_usb.c
  if (mode == USB_HOST_MODE)
  {
    USBx->GUSBCFG |= USB_OTG_GUSBCFG_FHMODE;

    do
    {
      DAL_Delay(1U);
      ms++;
    } while ((USB_GetMode(USBx) != (uint32_t)USB_HOST_MODE) && (ms < 50U));
  }
  else if (mode == USB_DEVICE_MODE)
  {
    USBx->GUSBCFG |= USB_OTG_GUSBCFG_FDMODE;

    do
    {
      DAL_Delay(1U);
      ms++;
    } while ((USB_GetMode(USBx) != (uint32_t)USB_DEVICE_MODE) && (ms < 50U));
  }
  else
  {
    return DAL_ERROR;
  }

  if (ms == 50U)
  {
    return DAL_ERROR;
  }

  return DAL_OK;
}

/**
  * @brief  USB_DevInit Initializes the USB_OTG controller registers
  *         for device mode
  * @param  USBx  Selected device
  * @param  cfg   pointer to a USB_OTG_CfgTypeDef structure that contains
  *         the configuration information for the specified USBx peripheral.
  * @retval DAL status
  */
DAL_StatusTypeDef USB_DevInit(USB_OTG_GlobalTypeDef *USBx, USB_OTG_CfgTypeDef cfg)
{
  DAL_StatusTypeDef ret = DAL_OK;
  uint32_t USBx_BASE = (uint32_t)USBx;
  uint32_t i;

  for (i = 0U; i < 15U; i++)
  {
    USBx->DTXFIFO[i] = 0U;
  }

  /* VBUS Sensing setup */
  if (cfg.vbus_sensing_enable == 0U)
  {
    /*
     * Disable HW VBUS sensing. VBUS is internally considered to be always
     * at VBUS-Valid level (5V).
     */
    USBx_DEVICE->DCTRL |= USB_OTG_DCTRL_SDCNNT;
    USBx->GGCCFG |= USB_OTG_GGCCFG_VBSDIS;
    USBx->GGCCFG &= ~USB_OTG_GGCCFG_BDVBSEN;
    USBx->GGCCFG &= ~USB_OTG_GGCCFG_ADVBSEN;
  }
  else
  {
    /* Enable HW VBUS sensing */
    USBx->GGCCFG &= ~USB_OTG_GGCCFG_VBSDIS;
    USBx->GGCCFG |= USB_OTG_GGCCFG_BDVBSEN;
  }

  /* Restart the Phy Clock */
  USBx_PCGCCTL = 0U;

  /* Device mode configuration */
  USBx_DEVICE->DCFG |= DCFG_FRAME_INTERVAL_80;

  if (cfg.phy_itface == USB_OTG_ULPI_PHY)
  {
    if (cfg.speed == USBD_HS_SPEED)
    {
      /* Set Core speed to High speed mode */
      (void)USB_SetDevSpeed(USBx, USB_OTG_SPEED_HIGH);
    }
    else
    {
      /* Set Core speed to Full speed mode */
      (void)USB_SetDevSpeed(USBx, USB_OTG_SPEED_HIGH_IN_FULL);
    }
  }
  else
  {
#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F465xx)
    if (cfg.speed == USBD_HS_SPEED)
    {
      /* Set Core speed to High speed mode */
      (void)USB_SetDevSpeed(USBx, USB_OTG_SPEED_HIGH);
    }
    else if (cfg.speed == USBD_HSINFS_SPEED)
    {
      /* Set Core speed to Full speed mode */
      (void)USB_SetDevSpeed(USBx, USB_OTG_SPEED_FULL);
    }
    else
    {
      /* Set Core speed to Full speed mode */
      (void)USB_SetDevSpeed(USBx, USB_OTG_SPEED_FULL);
    }
#else
    /* Set Core speed to Full speed mode */
    (void)USB_SetDevSpeed(USBx, USB_OTG_SPEED_FULL);
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F465xx */
  }

  /* Flush the FIFOs */
  if (USB_FlushTxFifo(USBx, 0x10U) != DAL_OK) /* all Tx FIFOs */
  {
    ret = DAL_ERROR;
  }

  if (USB_FlushRxFifo(USBx) != DAL_OK)
  {
    ret = DAL_ERROR;
  }

  /* Clear all pending Device Interrupts */
  USBx_DEVICE->DINIMASK = 0U;
  USBx_DEVICE->DOUTIMASK = 0U;
  USBx_DEVICE->DAEPIMASK = 0U;

  for (i = 0U; i < cfg.dev_endpoints; i++)
  {
    if ((USBx_INEP(i)->DIEPCTRL & USB_OTG_DIEPCTRL_EPEN) == USB_OTG_DIEPCTRL_EPEN)
    {
      if (i == 0U)
      {
        USBx_INEP(i)->DIEPCTRL = USB_OTG_DIEPCTRL_NAKSET;
      }
      else
      {
        USBx_INEP(i)->DIEPCTRL = USB_OTG_DIEPCTRL_EPDIS | USB_OTG_DIEPCTRL_NAKSET;
      }
    }
    else
    {
      USBx_INEP(i)->DIEPCTRL = 0U;
    }

    USBx_INEP(i)->DIEPTRS = 0U;
    USBx_INEP(i)->DIEPINT  = 0xFB7FU;
  }

  for (i = 0U; i < cfg.dev_endpoints; i++)
  {
    if ((USBx_OUTEP(i)->DOEPCTRL & USB_OTG_DOEPCTRL_EPEN) == USB_OTG_DOEPCTRL_EPEN)
    {
      if (i == 0U)
      {
        USBx_OUTEP(i)->DOEPCTRL = USB_OTG_DOEPCTRL_NAKSET;
      }
      else
      {
        USBx_OUTEP(i)->DOEPCTRL = USB_OTG_DOEPCTRL_EPDIS | USB_OTG_DOEPCTRL_NAKSET;
      }
    }
    else
    {
      USBx_OUTEP(i)->DOEPCTRL = 0U;
    }

    USBx_OUTEP(i)->DOEPTRS = 0U;
    USBx_OUTEP(i)->DOEPINT  = 0xFB7FU;
  }

  USBx_DEVICE->DINIMASK &= ~(USB_OTG_DINIMASK_FUDRM);

  /* Disable all interrupts. */
  USBx->GINTMASK = 0U;

  /* Clear any pending interrupts */
  USBx->GCINT = 0xBFFFFFFFU;

  /* Enable the common interrupts */
  if (cfg.dma_enable == 0U)
  {
    USBx->GINTMASK |= USB_OTG_GINTMASK_RXFNONEM;
  }

  /* Enable interrupts matching to the Device mode ONLY */
  USBx->GINTMASK |= USB_OTG_GINTMASK_USBSUSM | USB_OTG_GINTMASK_USBRSTM |
                   USB_OTG_GINTMASK_ENUMDM | USB_OTG_GINTMASK_INEPM |
                   USB_OTG_GINTMASK_OUTEPM   | USB_OTG_GINTMASK_IIINTXM |
                   USB_OTG_GINTMASK_IP_OUTTXM | USB_OTG_GINTMASK_RWAKEM;

  if (cfg.Sof_enable != 0U)
  {
    USBx->GINTMASK |= USB_OTG_GINTMASK_SOFM;
  }

  if (cfg.vbus_sensing_enable == 1U)
  {
    USBx->GINTMASK |= (USB_OTG_GINTMASK_SREQM | USB_OTG_GINTMASK_OTGM);
  }

  return ret;
}

/**
  * @brief  USB_FlushTxFifo Flush a Tx FIFO
  * @param  USBx  Selected device
  * @param  num  FIFO number
  *         This parameter can be a value from 1 to 15
            15 means Flush all Tx FIFOs
  * @retval DAL status
  */
DAL_StatusTypeDef USB_FlushTxFifo(USB_OTG_GlobalTypeDef *USBx, uint32_t num)
{
  __IO uint32_t count = 0U;

  /* Wait for AHB master IDLE state. */
  do
  {
    count++;

    if (count > 200000U)
    {
      return DAL_TIMEOUT;
    }
  } while ((USBx->GRSTCTRL & USB_OTG_GRSTCTRL_AHBMIDL) == 0U);

  /* Flush TX Fifo */
  count = 0U;
  USBx->GRSTCTRL = (USB_OTG_GRSTCTRL_TXFFLU | (num << 6));

  do
  {
    count++;

    if (count > 200000U)
    {
      return DAL_TIMEOUT;
    }
  } while ((USBx->GRSTCTRL & USB_OTG_GRSTCTRL_TXFFLU) == USB_OTG_GRSTCTRL_TXFFLU);

  return DAL_OK;
}

/**
  * @brief  USB_FlushRxFifo  Flush Rx FIFO
  * @param  USBx  Selected device
  * @retval DAL status
  */
DAL_StatusTypeDef USB_FlushRxFifo(USB_OTG_GlobalTypeDef *USBx)
{
  __IO uint32_t count = 0U;

  /* Wait for AHB master IDLE state. */
  do
  {
    count++;

    if (count > 200000U)
    {
      return DAL_TIMEOUT;
    }
  } while ((USBx->GRSTCTRL & USB_OTG_GRSTCTRL_AHBMIDL) == 0U);

  /* Flush RX Fifo */
  count = 0U;
  USBx->GRSTCTRL = USB_OTG_GRSTCTRL_RXFFLU;

  do
  {
    count++;

    if (count > 200000U)
    {
      return DAL_TIMEOUT;
    }
  } while ((USBx->GRSTCTRL & USB_OTG_GRSTCTRL_RXFFLU) == USB_OTG_GRSTCTRL_RXFFLU);

  return DAL_OK;
}

/**
  * @brief  USB_SetDevSpeed  Initializes the DevSpd field of DCFG register
  *         depending the PHY type and the enumeration speed of the device.
  * @param  USBx  Selected device
  * @param  speed  device speed
  *          This parameter can be one of these values:
  *            @arg USB_OTG_SPEED_HIGH: High speed mode
  *            @arg USB_OTG_SPEED_HIGH_IN_FULL: High speed core in Full Speed mode
  *            @arg USB_OTG_SPEED_FULL: Full speed mode
  * @retval  Hal status
  */
DAL_StatusTypeDef USB_SetDevSpeed(USB_OTG_GlobalTypeDef *USBx, uint8_t speed)
{
  uint32_t USBx_BASE = (uint32_t)USBx;

  USBx_DEVICE->DCFG |= speed;
  return DAL_OK;
}

/**
  * @brief  USB_GetDevSpeed  Return the Dev Speed
  * @param  USBx  Selected device
  * @retval speed  device speed
  *          This parameter can be one of these values:
  *            @arg USBD_HS_SPEED: High speed mode
  *            @arg USBD_FS_SPEED: Full speed mode
  */
uint8_t USB_GetDevSpeed(USB_OTG_GlobalTypeDef *USBx)
{
  uint32_t USBx_BASE = (uint32_t)USBx;
  uint8_t speed;
  uint32_t DevEnumSpeed = USBx_DEVICE->DSTS & USB_OTG_DSTS_ENUMSPD;

