betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_ddl_usb.c
  if (DevEnumSpeed == DSTS_ENUMSPD_HS_PHY_30MHZ_OR_60MHZ)
  {
    speed = USBD_HS_SPEED;
  }
  else if ((DevEnumSpeed == DSTS_ENUMSPD_FS_PHY_30MHZ_OR_60MHZ) ||
           (DevEnumSpeed == DSTS_ENUMSPD_FS_PHY_48MHZ))
  {
    speed = USBD_FS_SPEED;
  }
  else
  {
    speed = 0xFU;
  }

  return speed;
}

/**
  * @brief  Activate and configure an endpoint
  * @param  USBx  Selected device
  * @param  ep pointer to endpoint structure
  * @retval DAL status
  */
DAL_StatusTypeDef USB_ActivateEndpoint(USB_OTG_GlobalTypeDef *USBx, USB_OTG_EPTypeDef *ep)
{
  uint32_t USBx_BASE = (uint32_t)USBx;
  uint32_t epnum = (uint32_t)ep->num;

  if (ep->is_in == 1U)
  {
    USBx_DEVICE->DAEPIMASK |= USB_OTG_DAEPIMASK_AINM & (uint32_t)(1UL << (ep->num & EP_ADDR_MSK));

    if ((USBx_INEP(epnum)->DIEPCTRL & USB_OTG_DIEPCTRL_USBAEP) == 0U)
    {
      USBx_INEP(epnum)->DIEPCTRL |= (ep->maxpacket & USB_OTG_DIEPCTRL_MAXPS) |
                                   ((uint32_t)ep->type << 18) | (epnum << 22) |
                                   USB_OTG_DIEPCTRL_DPIDSET |
                                   USB_OTG_DIEPCTRL_USBAEP;
    }
  }
  else
  {
    USBx_DEVICE->DAEPIMASK |= USB_OTG_DAEPIMASK_AOUTM & ((uint32_t)(1UL << (ep->num & EP_ADDR_MSK)) << 16);

    if (((USBx_OUTEP(epnum)->DOEPCTRL) & USB_OTG_DOEPCTRL_USBAEP) == 0U)
    {
      USBx_OUTEP(epnum)->DOEPCTRL |= (ep->maxpacket & USB_OTG_DOEPCTRL_MAXPS) |
                                    ((uint32_t)ep->type << 18) |
                                    USB_OTG_DIEPCTRL_DPIDSET |
                                    USB_OTG_DOEPCTRL_USBAEP;
    }
  }
  return DAL_OK;
}

/**
  * @brief  Activate and configure a dedicated endpoint
  * @param  USBx  Selected device
  * @param  ep pointer to endpoint structure
  * @retval DAL status
  */
DAL_StatusTypeDef USB_ActivateDedicatedEndpoint(USB_OTG_GlobalTypeDef *USBx, USB_OTG_EPTypeDef *ep)
{
  uint32_t USBx_BASE = (uint32_t)USBx;
  uint32_t epnum = (uint32_t)ep->num;

  /* Read DEPCTLn register */
  if (ep->is_in == 1U)
  {
    if (((USBx_INEP(epnum)->DIEPCTRL) & USB_OTG_DIEPCTRL_USBAEP) == 0U)
    {
      USBx_INEP(epnum)->DIEPCTRL |= (ep->maxpacket & USB_OTG_DIEPCTRL_MAXPS) |
                                   ((uint32_t)ep->type << 18) | (epnum << 22) |
                                   USB_OTG_DIEPCTRL_DPIDSET |
                                   USB_OTG_DIEPCTRL_USBAEP;
    }

    USBx_DEVICE->DEPIMASK |= USB_OTG_DAEPIMASK_AINM & (uint32_t)(1UL << (ep->num & EP_ADDR_MSK));
  }
  else
  {
    if (((USBx_OUTEP(epnum)->DOEPCTRL) & USB_OTG_DOEPCTRL_USBAEP) == 0U)
    {
      USBx_OUTEP(epnum)->DOEPCTRL |= (ep->maxpacket & USB_OTG_DOEPCTRL_MAXPS) |
                                    ((uint32_t)ep->type << 18) | (epnum << 22) |
                                    USB_OTG_DOEPCTRL_USBAEP;
    }

    USBx_DEVICE->DEPIMASK |= USB_OTG_DAEPIMASK_AOUTM & ((uint32_t)(1UL << (ep->num & EP_ADDR_MSK)) << 16);
  }

  return DAL_OK;
}

/**
  * @brief  De-activate and de-initialize an endpoint
  * @param  USBx  Selected device
  * @param  ep pointer to endpoint structure
  * @retval DAL status
  */
DAL_StatusTypeDef USB_DeactivateEndpoint(USB_OTG_GlobalTypeDef *USBx, USB_OTG_EPTypeDef *ep)
{
  uint32_t USBx_BASE = (uint32_t)USBx;
  uint32_t epnum = (uint32_t)ep->num;

  /* Read DEPCTLn register */
  if (ep->is_in == 1U)
  {
    if ((USBx_INEP(epnum)->DIEPCTRL & USB_OTG_DIEPCTRL_EPEN) == USB_OTG_DIEPCTRL_EPEN)
    {
      USBx_INEP(epnum)->DIEPCTRL |= USB_OTG_DIEPCTRL_NAKSET;
      USBx_INEP(epnum)->DIEPCTRL |= USB_OTG_DIEPCTRL_EPDIS;
    }

    USBx_DEVICE->DEPIMASK &= ~(USB_OTG_DAEPIMASK_AINM & (uint32_t)(1UL << (ep->num & EP_ADDR_MSK)));
    USBx_DEVICE->DAEPIMASK &= ~(USB_OTG_DAEPIMASK_AINM & (uint32_t)(1UL << (ep->num & EP_ADDR_MSK)));
    USBx_INEP(epnum)->DIEPCTRL &= ~(USB_OTG_DIEPCTRL_USBAEP |
                                   USB_OTG_DIEPCTRL_MAXPS |
                                   USB_OTG_DIEPCTRL_TXFNUM |
                                   USB_OTG_DIEPCTRL_DPIDSET |
                                   USB_OTG_DIEPCTRL_EPTYPE);
  }
  else
  {
    if ((USBx_OUTEP(epnum)->DOEPCTRL & USB_OTG_DOEPCTRL_EPEN) == USB_OTG_DOEPCTRL_EPEN)
    {
      USBx_OUTEP(epnum)->DOEPCTRL |= USB_OTG_DOEPCTRL_NAKSET;
      USBx_OUTEP(epnum)->DOEPCTRL |= USB_OTG_DOEPCTRL_EPDIS;
    }

    USBx_DEVICE->DEPIMASK &= ~(USB_OTG_DAEPIMASK_AOUTM & ((uint32_t)(1UL << (ep->num & EP_ADDR_MSK)) << 16));
    USBx_DEVICE->DAEPIMASK &= ~(USB_OTG_DAEPIMASK_AOUTM & ((uint32_t)(1UL << (ep->num & EP_ADDR_MSK)) << 16));
    USBx_OUTEP(epnum)->DOEPCTRL &= ~(USB_OTG_DOEPCTRL_USBAEP |
                                    USB_OTG_DOEPCTRL_MAXPS |
                                    USB_OTG_DOEPCTRL_DPIDSET |
                                    USB_OTG_DOEPCTRL_EPTYPE);
  }

  return DAL_OK;
}

/**
  * @brief  De-activate and de-initialize a dedicated endpoint
  * @param  USBx  Selected device
  * @param  ep pointer to endpoint structure
  * @retval DAL status
  */
DAL_StatusTypeDef USB_DeactivateDedicatedEndpoint(USB_OTG_GlobalTypeDef *USBx, USB_OTG_EPTypeDef *ep)
{
  uint32_t USBx_BASE = (uint32_t)USBx;
  uint32_t epnum = (uint32_t)ep->num;

  /* Read DEPCTLn register */
  if (ep->is_in == 1U)
  {
    if ((USBx_INEP(epnum)->DIEPCTRL & USB_OTG_DIEPCTRL_EPEN) == USB_OTG_DIEPCTRL_EPEN)
    {
      USBx_INEP(epnum)->DIEPCTRL  |= USB_OTG_DIEPCTRL_NAKSET;
      USBx_INEP(epnum)->DIEPCTRL  |= USB_OTG_DIEPCTRL_EPDIS;
    }

    USBx_INEP(epnum)->DIEPCTRL &= ~ USB_OTG_DIEPCTRL_USBAEP;
    USBx_DEVICE->DAEPIMASK &= ~(USB_OTG_DAEPIMASK_AINM & (uint32_t)(1UL << (ep->num & EP_ADDR_MSK)));
  }
  else
  {
    if ((USBx_OUTEP(epnum)->DOEPCTRL & USB_OTG_DOEPCTRL_EPEN) == USB_OTG_DOEPCTRL_EPEN)
    {
      USBx_OUTEP(epnum)->DOEPCTRL  |= USB_OTG_DOEPCTRL_NAKSET;
      USBx_OUTEP(epnum)->DOEPCTRL  |= USB_OTG_DOEPCTRL_EPDIS;
    }

    USBx_OUTEP(epnum)->DOEPCTRL &= ~USB_OTG_DOEPCTRL_USBAEP;
    USBx_DEVICE->DAEPIMASK &= ~(USB_OTG_DAEPIMASK_AOUTM & ((uint32_t)(1UL << (ep->num & EP_ADDR_MSK)) << 16));
  }

  return DAL_OK;
}

/**
  * @brief  USB_EPStartXfer : setup and starts a transfer over an EP
  * @param  USBx  Selected device
  * @param  ep pointer to endpoint structure
  * @param  dma USB dma enabled or disabled
  *          This parameter can be one of these values:
  *           0 : DMA feature not used
  *           1 : DMA feature used
  * @retval DAL status
  */
DAL_StatusTypeDef USB_EPStartXfer(USB_OTG_GlobalTypeDef *USBx, USB_OTG_EPTypeDef *ep, uint8_t dma)
{
  uint32_t USBx_BASE = (uint32_t)USBx;
  uint32_t epnum = (uint32_t)ep->num;
  uint16_t pktcnt;

  /* IN endpoint */
  if (ep->is_in == 1U)
  {
    /* Zero Length Packet? */
    if (ep->xfer_len == 0U)
    {
      USBx_INEP(epnum)->DIEPTRS &= ~(USB_OTG_DIEPTRS_EPPCNT);
      USBx_INEP(epnum)->DIEPTRS |= (USB_OTG_DIEPTRS_EPPCNT & (1U << 19));
      USBx_INEP(epnum)->DIEPTRS &= ~(USB_OTG_DIEPTRS_EPTRS);
    }
    else
    {
      /* Program the transfer size and packet count
      * as follows: xfersize = N * maxpacket +
      * short_packet pktcnt = N + (short_packet
      * exist ? 1 : 0)
      */
      USBx_INEP(epnum)->DIEPTRS &= ~(USB_OTG_DIEPTRS_EPTRS);
      USBx_INEP(epnum)->DIEPTRS &= ~(USB_OTG_DIEPTRS_EPPCNT);
      USBx_INEP(epnum)->DIEPTRS |= (USB_OTG_DIEPTRS_EPPCNT &
                                     (((ep->xfer_len + ep->maxpacket - 1U) / ep->maxpacket) << 19));

