betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_ddl_usb.c
      USBx_INEP(epnum)->DIEPTRS |= (USB_OTG_DIEPTRS_EPTRS & ep->xfer_len);

      if (ep->type == EP_TYPE_ISOC)
      {
        USBx_INEP(epnum)->DIEPTRS &= ~(USB_OTG_DIEPTRS_TXDSEL);
        USBx_INEP(epnum)->DIEPTRS |= (USB_OTG_DIEPTRS_TXDSEL & (1U << 29));
      }
    }

    if (dma == 1U)
    {
      if ((uint32_t)ep->dma_addr != 0U)
      {
        USBx_INEP(epnum)->DIEPDMA = (uint32_t)(ep->dma_addr);
      }

      if (ep->type == EP_TYPE_ISOC)
      {
        if ((USBx_DEVICE->DSTS & (1U << 8)) == 0U)
        {
          USBx_INEP(epnum)->DIEPCTRL |= USB_OTG_DIEPCTRL_OFSET;
        }
        else
        {
          USBx_INEP(epnum)->DIEPCTRL |= USB_OTG_DIEPCTRL_DPIDSET;
        }
      }

      /* EP enable, IN data in FIFO */
      USBx_INEP(epnum)->DIEPCTRL |= (USB_OTG_DIEPCTRL_NAKCLR | USB_OTG_DIEPCTRL_EPEN);
    }
    else
    {
      /* EP enable, IN data in FIFO */
      USBx_INEP(epnum)->DIEPCTRL |= (USB_OTG_DIEPCTRL_NAKCLR | USB_OTG_DIEPCTRL_EPEN);

      if (ep->type != EP_TYPE_ISOC)
      {
        /* Enable the Tx FIFO Empty Interrupt for this EP */
        if (ep->xfer_len > 0U)
        {
          USBx_DEVICE->DIEIMASK |= 1UL << (ep->num & EP_ADDR_MSK);
        }
      }
      else
      {
        if ((USBx_DEVICE->DSTS & (1U << 8)) == 0U)
        {
          USBx_INEP(epnum)->DIEPCTRL |= USB_OTG_DIEPCTRL_OFSET;
        }
        else
        {
          USBx_INEP(epnum)->DIEPCTRL |= USB_OTG_DIEPCTRL_DPIDSET;
        }

        (void)USB_WritePacket(USBx, ep->xfer_buff, ep->num, (uint16_t)ep->xfer_len, dma);
      }
    }
  }
  else /* OUT endpoint */
  {
    /* Program the transfer size and packet count as follows:
    * pktcnt = N
    * xfersize = N * maxpacket
    */
    USBx_OUTEP(epnum)->DOEPTRS &= ~(USB_OTG_DOEPTRS_EPTRS);
    USBx_OUTEP(epnum)->DOEPTRS &= ~(USB_OTG_DOEPTRS_EPPCNT);

    if (ep->xfer_len == 0U)
    {
      USBx_OUTEP(epnum)->DOEPTRS |= (USB_OTG_DOEPTRS_EPTRS & ep->maxpacket);
      USBx_OUTEP(epnum)->DOEPTRS |= (USB_OTG_DOEPTRS_EPPCNT & (1U << 19));
    }
    else
    {
      pktcnt = (uint16_t)((ep->xfer_len + ep->maxpacket - 1U) / ep->maxpacket);
      ep->xfer_size = ep->maxpacket * pktcnt;

      USBx_OUTEP(epnum)->DOEPTRS |= USB_OTG_DOEPTRS_EPPCNT & ((uint32_t)pktcnt << 19);
      USBx_OUTEP(epnum)->DOEPTRS |= USB_OTG_DOEPTRS_EPTRS & ep->xfer_size;
    }

    if (dma == 1U)
    {
      if ((uint32_t)ep->xfer_buff != 0U)
      {
        USBx_OUTEP(epnum)->DOEPDMA = (uint32_t)(ep->xfer_buff);
      }
    }

    if (ep->type == EP_TYPE_ISOC)
    {
      if ((USBx_DEVICE->DSTS & (1U << 8)) == 0U)
      {
        USBx_OUTEP(epnum)->DOEPCTRL |= USB_OTG_DOEPCTRL_OFSET;
      }
      else
      {
        USBx_OUTEP(epnum)->DOEPCTRL |= USB_OTG_DOEPCTRL_DPIDSET;
      }
    }
    /* EP enable */
    USBx_OUTEP(epnum)->DOEPCTRL |= (USB_OTG_DOEPCTRL_NAKCLR | USB_OTG_DOEPCTRL_EPEN);
  }

  return DAL_OK;
}

/**
  * @brief  USB_EP0StartXfer : setup and starts a transfer over the EP  0
  * @param  USBx  Selected device
  * @param  ep pointer to endpoint structure
  * @param  dma USB dma enabled or disabled
  *          This parameter can be one of these values:
  *           0 : DMA feature not used
  *           1 : DMA feature used
  * @retval DAL status
  */
DAL_StatusTypeDef USB_EP0StartXfer(USB_OTG_GlobalTypeDef *USBx, USB_OTG_EPTypeDef *ep, uint8_t dma)
{
  uint32_t USBx_BASE = (uint32_t)USBx;
  uint32_t epnum = (uint32_t)ep->num;

  /* IN endpoint */
  if (ep->is_in == 1U)
  {
    /* Zero Length Packet? */
    if (ep->xfer_len == 0U)
    {
      USBx_INEP(epnum)->DIEPTRS &= ~(USB_OTG_DIEPTRS_EPPCNT);
      USBx_INEP(epnum)->DIEPTRS |= (USB_OTG_DIEPTRS_EPPCNT & (1U << 19));
      USBx_INEP(epnum)->DIEPTRS &= ~(USB_OTG_DIEPTRS_EPTRS);
    }
    else
    {
      /* Program the transfer size and packet count
      * as follows: xfersize = N * maxpacket +
      * short_packet pktcnt = N + (short_packet
      * exist ? 1 : 0)
      */
      USBx_INEP(epnum)->DIEPTRS &= ~(USB_OTG_DIEPTRS_EPTRS);
      USBx_INEP(epnum)->DIEPTRS &= ~(USB_OTG_DIEPTRS_EPPCNT);

      if (ep->xfer_len > ep->maxpacket)
      {
        ep->xfer_len = ep->maxpacket;
      }
      USBx_INEP(epnum)->DIEPTRS |= (USB_OTG_DIEPTRS_EPPCNT & (1U << 19));
      USBx_INEP(epnum)->DIEPTRS |= (USB_OTG_DIEPTRS_EPTRS & ep->xfer_len);
    }

    if (dma == 1U)
    {
      if ((uint32_t)ep->dma_addr != 0U)
      {
        USBx_INEP(epnum)->DIEPDMA = (uint32_t)(ep->dma_addr);
      }

      /* EP enable, IN data in FIFO */
      USBx_INEP(epnum)->DIEPCTRL |= (USB_OTG_DIEPCTRL_NAKCLR | USB_OTG_DIEPCTRL_EPEN);
    }
    else
    {
      /* EP enable, IN data in FIFO */
      USBx_INEP(epnum)->DIEPCTRL |= (USB_OTG_DIEPCTRL_NAKCLR | USB_OTG_DIEPCTRL_EPEN);

      /* Enable the Tx FIFO Empty Interrupt for this EP */
      if (ep->xfer_len > 0U)
      {
        USBx_DEVICE->DIEIMASK |= 1UL << (ep->num & EP_ADDR_MSK);
      }
    }
  }
  else /* OUT endpoint */
  {
    /* Program the transfer size and packet count as follows:
    * pktcnt = N
    * xfersize = N * maxpacket
    */
    USBx_OUTEP(epnum)->DOEPTRS &= ~(USB_OTG_DOEPTRS_EPTRS);
    USBx_OUTEP(epnum)->DOEPTRS &= ~(USB_OTG_DOEPTRS_EPPCNT);

    if (ep->xfer_len > 0U)
    {
      ep->xfer_len = ep->maxpacket;
    }

    /* Store transfer size, for EP0 this is equal to endpoint max packet size */
    ep->xfer_size = ep->maxpacket;

    USBx_OUTEP(epnum)->DOEPTRS |= (USB_OTG_DOEPTRS_EPPCNT & (1U << 19));
    USBx_OUTEP(epnum)->DOEPTRS |= (USB_OTG_DOEPTRS_EPTRS & ep->xfer_size);

    if (dma == 1U)
    {
      if ((uint32_t)ep->xfer_buff != 0U)
      {
        USBx_OUTEP(epnum)->DOEPDMA = (uint32_t)(ep->xfer_buff);
      }
    }

    /* EP enable */
    USBx_OUTEP(epnum)->DOEPCTRL |= (USB_OTG_DOEPCTRL_NAKCLR | USB_OTG_DOEPCTRL_EPEN);
  }

  return DAL_OK;
}


/**
   * @brief  USB_EPStoptXfer  Stop transfer on an EP
   * @param  USBx  usb device instance
   * @param  ep pointer to endpoint structure
   * @retval DAL status
   */
DAL_StatusTypeDef USB_EPStopXfer(USB_OTG_GlobalTypeDef *USBx, USB_OTG_EPTypeDef *ep)
{
  __IO uint32_t count = 0U;
  DAL_StatusTypeDef ret = DAL_OK;
  uint32_t USBx_BASE = (uint32_t)USBx;

  /* IN endpoint */
  if (ep->is_in == 1U)
  {
    /* EP enable, IN data in FIFO */
    if (((USBx_INEP(ep->num)->DIEPCTRL) & USB_OTG_DIEPCTRL_EPEN) == USB_OTG_DIEPCTRL_EPEN)
    {
      USBx_INEP(ep->num)->DIEPCTRL |= (USB_OTG_DIEPCTRL_NAKSET);
      USBx_INEP(ep->num)->DIEPCTRL |= (USB_OTG_DIEPCTRL_EPDIS);

      do
      {
        count++;

        if (count > 10000U)
        {
          ret = DAL_ERROR;
          break;
        }
      } while (((USBx_INEP(ep->num)->DIEPCTRL) & USB_OTG_DIEPCTRL_EPEN) ==  USB_OTG_DIEPCTRL_EPEN);
    }
  }
  else /* OUT endpoint */
  {
    if (((USBx_OUTEP(ep->num)->DOEPCTRL) & USB_OTG_DOEPCTRL_EPEN) == USB_OTG_DOEPCTRL_EPEN)
    {
      USBx_OUTEP(ep->num)->DOEPCTRL |= (USB_OTG_DOEPCTRL_NAKSET);
      USBx_OUTEP(ep->num)->DOEPCTRL |= (USB_OTG_DOEPCTRL_EPDIS);

      do
      {
        count++;

        if (count > 10000U)
        {
          ret = DAL_ERROR;
          break;
        }
      } while (((USBx_OUTEP(ep->num)->DOEPCTRL) & USB_OTG_DOEPCTRL_EPEN) ==  USB_OTG_DOEPCTRL_EPEN);
    }
  }

  return ret;
}


/**
  * @brief  USB_WritePacket : Writes a packet into the Tx FIFO associated
  *         with the EP/channel
  * @param  USBx  Selected device
  * @param  src   pointer to source buffer
  * @param  ch_ep_num  endpoint or host channel number
  * @param  len  Number of bytes to write
  * @param  dma USB dma enabled or disabled
  *          This parameter can be one of these values:
  *           0 : DMA feature not used
  *           1 : DMA feature used
  * @retval DAL status
  */
DAL_StatusTypeDef USB_WritePacket(USB_OTG_GlobalTypeDef *USBx, uint8_t *src,
                                  uint8_t ch_ep_num, uint16_t len, uint8_t dma)
{
  uint32_t USBx_BASE = (uint32_t)USBx;
  uint8_t *pSrc = src;
  uint32_t count32b;
  uint32_t i;

