betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_ddl_usb.c
  tmpreg  = USBx_OUTEP((uint32_t)epnum)->DOEPINT;
  tmpreg &= USBx_DEVICE->DOUTIMASK;

  return tmpreg;
}

/**
  * @brief  Returns Device IN EP Interrupt register
  * @param  USBx  Selected device
  * @param  epnum  endpoint number
  *          This parameter can be a value from 0 to 15
  * @retval Device IN EP Interrupt register
  */
uint32_t USB_ReadDevInEPInterrupt(USB_OTG_GlobalTypeDef *USBx, uint8_t epnum)
{
  uint32_t USBx_BASE = (uint32_t)USBx;
  uint32_t tmpreg;
  uint32_t msk;
  uint32_t emp;

  msk = USBx_DEVICE->DINIMASK;
  emp = USBx_DEVICE->DIEIMASK;
  msk |= ((emp >> (epnum & EP_ADDR_MSK)) & 0x1U) << 7;
  tmpreg = USBx_INEP((uint32_t)epnum)->DIEPINT & msk;

  return tmpreg;
}

/**
  * @brief  USB_ClearInterrupts: clear a USB interrupt
  * @param  USBx  Selected device
  * @param  interrupt  flag
  * @retval None
  */
void  USB_ClearInterrupts(USB_OTG_GlobalTypeDef *USBx, uint32_t interrupt)
{
  USBx->GCINT &= interrupt;
}

/**
  * @brief  Returns USB core mode
  * @param  USBx  Selected device
  * @retval return core mode : Host or Device
  *          This parameter can be one of these values:
  *           0 : Host
  *           1 : Device
  */
uint32_t USB_GetMode(USB_OTG_GlobalTypeDef *USBx)
{
  return ((USBx->GCINT) & 0x1U);
}

/**
  * @brief  Activate EP0 for Setup transactions
  * @param  USBx  Selected device
  * @retval DAL status
  */
DAL_StatusTypeDef  USB_ActivateSetup(USB_OTG_GlobalTypeDef *USBx)
{
  uint32_t USBx_BASE = (uint32_t)USBx;

  /* Set the MPS of the IN EP0 to 64 bytes */
  USBx_INEP(0U)->DIEPCTRL &= ~USB_OTG_DIEPCTRL_MAXPS;

  USBx_DEVICE->DCTRL |= USB_OTG_DCTRL_GINAKCLR;

  return DAL_OK;
}

/**
  * @brief  Prepare the EP0 to start the first control setup
  * @param  USBx  Selected device
  * @param  dma USB dma enabled or disabled
  *          This parameter can be one of these values:
  *           0 : DMA feature not used
  *           1 : DMA feature used
  * @param  psetup  pointer to setup packet
  * @retval DAL status
  */
DAL_StatusTypeDef USB_EP0_OutStart(USB_OTG_GlobalTypeDef *USBx, uint8_t dma, uint8_t *psetup)
{
  uint32_t USBx_BASE = (uint32_t)USBx;
  uint32_t gSNPSiD = *(__IO uint32_t *)(&USBx->GCID + 0x1U);

  if (gSNPSiD > USB_OTG_CORE_ID_300A)
  {
    if ((USBx_OUTEP(0U)->DOEPCTRL & USB_OTG_DOEPCTRL_EPEN) == USB_OTG_DOEPCTRL_EPEN)
    {
      return DAL_OK;
    }
  }

  USBx_OUTEP(0U)->DOEPTRS = 0U;
  USBx_OUTEP(0U)->DOEPTRS |= (USB_OTG_DOEPTRS_EPPCNT & (1U << 19));
  USBx_OUTEP(0U)->DOEPTRS |= (3U * 8U);
  USBx_OUTEP(0U)->DOEPTRS |=  USB_OTG_DOEPTRS_SPCNT;

  if (dma == 1U)
  {
    USBx_OUTEP(0U)->DOEPDMA = (uint32_t)psetup;
    /* EP enable */
    USBx_OUTEP(0U)->DOEPCTRL |= USB_OTG_DOEPCTRL_EPEN | USB_OTG_DOEPCTRL_USBAEP;
  }

  return DAL_OK;
}

/**
  * @brief  Reset the USB Core (needed after USB clock settings change)
  * @param  USBx  Selected device
  * @retval DAL status
  */
static DAL_StatusTypeDef USB_CoreReset(USB_OTG_GlobalTypeDef *USBx)
{
  __IO uint32_t count = 0U;

  /* Wait for AHB master IDLE state. */
  do
  {
    count++;

    if (count > 200000U)
    {
      return DAL_TIMEOUT;
    }
  } while ((USBx->GRSTCTRL & USB_OTG_GRSTCTRL_AHBMIDL) == 0U);

  /* Core Soft Reset */
  count = 0U;
  USBx->GRSTCTRL |= USB_OTG_GRSTCTRL_CSRST;

  do
  {
    count++;

    if (count > 200000U)
    {
      return DAL_TIMEOUT;
    }
  } while ((USBx->GRSTCTRL & USB_OTG_GRSTCTRL_CSRST) == USB_OTG_GRSTCTRL_CSRST);

  return DAL_OK;
}

/**
  * @brief  USB_HostInit : Initializes the USB OTG controller registers
  *         for Host mode
  * @param  USBx  Selected device
  * @param  cfg   pointer to a USB_OTG_CfgTypeDef structure that contains
  *         the configuration information for the specified USBx peripheral.
  * @retval DAL status
  */
DAL_StatusTypeDef USB_HostInit(USB_OTG_GlobalTypeDef *USBx, USB_OTG_CfgTypeDef cfg)
{
  DAL_StatusTypeDef ret = DAL_OK;
  uint32_t USBx_BASE = (uint32_t)USBx;
  uint32_t i;

  /* Restart the Phy Clock */
  USBx_PCGCCTL = 0U;

  /*
  * Disable HW VBUS sensing. VBUS is internally considered to be always
  * at VBUS-Valid level (5V).
  */
  USBx->GGCCFG |= USB_OTG_GGCCFG_VBSDIS;
  USBx->GGCCFG &= ~USB_OTG_GGCCFG_BDVBSEN;
  USBx->GGCCFG &= ~USB_OTG_GGCCFG_ADVBSEN;

  if ((USBx->GUSBCFG & USB_OTG_GUSBCFG_FSSTSEL) == 0U)
  {
    if (cfg.speed == USBH_FSLS_SPEED)
    {
      /* Force Device Enumeration to FS/LS mode only */
      USBx_HOST->HCFG |= USB_OTG_HCFG_FSSPT;
    }
    else
    {
      /* Set default Max speed support */
      USBx_HOST->HCFG &= ~(USB_OTG_HCFG_FSSPT);
    }
  }
  else
  {
    /* Set default Max speed support */
    USBx_HOST->HCFG &= ~(USB_OTG_HCFG_FSSPT);
  }

  /* Make sure the FIFOs are flushed. */
  if (USB_FlushTxFifo(USBx, 0x10U) != DAL_OK) /* all Tx FIFOs */
  {
    ret = DAL_ERROR;
  }

  if (USB_FlushRxFifo(USBx) != DAL_OK)
  {
    ret = DAL_ERROR;
  }

  /* Clear all pending HC Interrupts */
  for (i = 0U; i < cfg.Host_channels; i++)
  {
    USBx_HC(i)->HCHINT = 0xFFFFFFFFU;
    USBx_HC(i)->HCHIMASK = 0U;
  }

  /* Disable all interrupts. */
  USBx->GINTMASK = 0U;

  /* Clear any pending interrupts */
  USBx->GCINT = 0xFFFFFFFFU;

#if defined (USB_OTG_HS)
  if (USBx == USB_OTG_HS)
  {
    /* set Rx FIFO size */
    USBx->GRXFIFO  = 0x200U;
    USBx->GTXFCFG = (uint32_t)(((0x100U << 16) & USB_OTG_NPTXFDEP) | 0x200U);
    USBx->GHPTXFSIZE = (uint32_t)(((0xE0U << 16) & USB_OTG_GHPTXFSIZE_HPDTXFDEP) | 0x300U);
  }
  else
#endif /* defined (USB_OTG_HS) */
  {
    /* set Rx FIFO size */
    USBx->GRXFIFO  = 0x80U;
    USBx->GTXFCFG = (uint32_t)(((0x60U << 16) & USB_OTG_NPTXFDEP) | 0x80U);
    USBx->GHPTXFSIZE = (uint32_t)(((0x40U << 16)& USB_OTG_GHPTXFSIZE_HPDTXFDEP) | 0xE0U);
  }

  /* Enable the common interrupts */
  if (cfg.dma_enable == 0U)
  {
    USBx->GINTMASK |= USB_OTG_GINTMASK_RXFNONEM;
  }

  /* Enable interrupts matching to the Host mode ONLY */
  USBx->GINTMASK |= (USB_OTG_GINTMASK_HPORTM            | USB_OTG_GINTMASK_HCHM | \
                    USB_OTG_GINTMASK_SOFM             | USB_OTG_GCINT_DEDIS | \
                    USB_OTG_GINTMASK_IP_OUTTXM  | USB_OTG_GINTMASK_RWAKEM);

  return ret;
}

/**
  * @brief  USB_InitFSLSPClkSel : Initializes the FSLSPClkSel field of the
  *         HCFG register on the PHY type and set the right frame interval
  * @param  USBx  Selected device
  * @param  freq  clock frequency
  *          This parameter can be one of these values:
  *           HCFG_48_MHZ : Full Speed 48 MHz Clock
  *           HCFG_6_MHZ : Low Speed 6 MHz Clock
  * @retval DAL status
  */
DAL_StatusTypeDef USB_InitFSLSPClkSel(USB_OTG_GlobalTypeDef *USBx, uint8_t freq)
{
  uint32_t USBx_BASE = (uint32_t)USBx;

  USBx_HOST->HCFG &= ~(USB_OTG_HCFG_PHYCLKSEL);
  USBx_HOST->HCFG |= (uint32_t)freq & USB_OTG_HCFG_PHYCLKSEL;

  if (freq == HCFG_48_MHZ)
  {
    USBx_HOST->HFIVL = 48000U;
  }
  else if (freq == HCFG_6_MHZ)
  {
    USBx_HOST->HFIVL = 6000U;
  }
  else
  {
    /* ... */
  }

  return DAL_OK;
}

/**
  * @brief  USB_OTG_ResetPort : Reset Host Port
  * @param  USBx  Selected device
  * @retval DAL status
  * @note (1)The application must wait at least 10 ms
  *   before clearing the reset bit.
  */
DAL_StatusTypeDef USB_ResetPort(USB_OTG_GlobalTypeDef *USBx)
{
  uint32_t USBx_BASE = (uint32_t)USBx;

