betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_ddl_usb.c
  __IO uint32_t hprt0 = 0U;

  hprt0 = USBx_HPRT0;

  hprt0 &= ~(USB_OTG_HPORTCSTS_PEN | USB_OTG_HPORTCSTS_PCINTFLG |
             USB_OTG_HPORTCSTS_PENCHG | USB_OTG_HPORTCSTS_POVCCHG);

  USBx_HPRT0 = (USB_OTG_HPORTCSTS_PRST | hprt0);
  DAL_Delay(100U);                                 /* See Note #1 */
  USBx_HPRT0 = ((~USB_OTG_HPORTCSTS_PRST) & hprt0);
  DAL_Delay(10U);

  return DAL_OK;
}

/**
  * @brief  USB_DriveVbus : activate or de-activate vbus
  * @param  state  VBUS state
  *          This parameter can be one of these values:
  *           0 : Deactivate VBUS
  *           1 : Activate VBUS
  * @retval DAL status
  */
DAL_StatusTypeDef USB_DriveVbus(USB_OTG_GlobalTypeDef *USBx, uint8_t state)
{
  uint32_t USBx_BASE = (uint32_t)USBx;
  __IO uint32_t hprt0 = 0U;

  hprt0 = USBx_HPRT0;

  hprt0 &= ~(USB_OTG_HPORTCSTS_PEN | USB_OTG_HPORTCSTS_PCINTFLG |
             USB_OTG_HPORTCSTS_PENCHG | USB_OTG_HPORTCSTS_POVCCHG);

  if (((hprt0 & USB_OTG_HPORTCSTS_PP) == 0U) && (state == 1U))
  {
    USBx_HPRT0 = (USB_OTG_HPORTCSTS_PP | hprt0);
  }
  if (((hprt0 & USB_OTG_HPORTCSTS_PP) == USB_OTG_HPORTCSTS_PP) && (state == 0U))
  {
    USBx_HPRT0 = ((~USB_OTG_HPORTCSTS_PP) & hprt0);
  }
  return DAL_OK;
}

/**
  * @brief  Return Host Core speed
  * @param  USBx  Selected device
  * @retval speed : Host speed
  *          This parameter can be one of these values:
  *            @arg HCD_SPEED_HIGH: High speed mode
  *            @arg HCD_SPEED_FULL: Full speed mode
  *            @arg HCD_SPEED_LOW: Low speed mode
  */
uint32_t USB_GetHostSpeed(USB_OTG_GlobalTypeDef *USBx)
{
  uint32_t USBx_BASE = (uint32_t)USBx;
  __IO uint32_t hprt0 = 0U;

  hprt0 = USBx_HPRT0;
  return ((hprt0 & USB_OTG_HPORTCSTS_PSPDSEL) >> 17);
}

/**
  * @brief  Return Host Current Frame number
  * @param  USBx  Selected device
  * @retval current frame number
  */
uint32_t USB_GetCurrentFrame(USB_OTG_GlobalTypeDef *USBx)
{
  uint32_t USBx_BASE = (uint32_t)USBx;

  return (USBx_HOST->HFIFM & USB_OTG_HFIFM_FNUM);
}

/**
  * @brief  Initialize a host channel
  * @param  USBx  Selected device
  * @param  ch_num  Channel number
  *         This parameter can be a value from 1 to 15
  * @param  epnum  Endpoint number
  *          This parameter can be a value from 1 to 15
  * @param  dev_address  Current device address
  *          This parameter can be a value from 0 to 255
  * @param  speed  Current device speed
  *          This parameter can be one of these values:
  *            @arg USB_OTG_SPEED_HIGH: High speed mode
  *            @arg USB_OTG_SPEED_FULL: Full speed mode
  *            @arg USB_OTG_SPEED_LOW: Low speed mode
  * @param  ep_type  Endpoint Type
  *          This parameter can be one of these values:
  *            @arg EP_TYPE_CTRL: Control type
  *            @arg EP_TYPE_ISOC: Isochronous type
  *            @arg EP_TYPE_BULK: Bulk type
  *            @arg EP_TYPE_INTR: Interrupt type
  * @param  mps  Max Packet Size
  *          This parameter can be a value from 0 to 32K
  * @retval DAL state
  */
DAL_StatusTypeDef USB_HC_Init(USB_OTG_GlobalTypeDef *USBx, uint8_t ch_num,
                              uint8_t epnum, uint8_t dev_address, uint8_t speed,
                              uint8_t ep_type, uint16_t mps)
{
  DAL_StatusTypeDef ret = DAL_OK;
  uint32_t USBx_BASE = (uint32_t)USBx;
  uint32_t HCcharEpDir;
  uint32_t HCcharLowSpeed;
  uint32_t HostCoreSpeed;

  /* Clear old interrupt conditions for this host channel. */
  USBx_HC((uint32_t)ch_num)->HCHINT = 0xFFFFFFFFU;

  /* Enable channel interrupts required for this transfer. */
  switch (ep_type)
  {
    case EP_TYPE_CTRL:
    case EP_TYPE_BULK:
      USBx_HC((uint32_t)ch_num)->HCHIMASK = USB_OTG_HCHIMASK_TSFCMPNM  |
                                            USB_OTG_HCHIMASK_RXSTALLM |
                                            USB_OTG_HCHIMASK_TERRM |
                                            USB_OTG_HCHIMASK_DTOGM |
                                            USB_OTG_HCHIMASK_AHBERRM |
                                            USB_OTG_HCHIMASK_RXNAKM;

      if ((epnum & 0x80U) == 0x80U)
      {
        USBx_HC((uint32_t)ch_num)->HCHIMASK |= USB_OTG_HCHIMASK_BABBLEM;
      }
      else
      {
#if defined (USB_OTG_HS)
        if (USBx == USB_OTG_HS)
        {
          USBx_HC((uint32_t)ch_num)->HCHIMASK |= USB_OTG_HCHIMASK_RXNYETM |
                                                 USB_OTG_HCHIMASK_RXTXACKM;
        }
#endif /* defined (USB_OTG_HS) */
      }
      break;

    case EP_TYPE_INTR:
      USBx_HC((uint32_t)ch_num)->HCHIMASK = USB_OTG_HCHIMASK_TSFCMPNM  |
                                            USB_OTG_HCHIMASK_RXSTALLM |
                                            USB_OTG_HCHIMASK_TERRM |
                                            USB_OTG_HCHIMASK_DTOGM |
                                            USB_OTG_HCHIMASK_RXNAKM   |
                                            USB_OTG_HCHIMASK_AHBERRM |
                                            USB_OTG_HCHIMASK_FOVRM;

      if ((epnum & 0x80U) == 0x80U)
      {
        USBx_HC((uint32_t)ch_num)->HCHIMASK |= USB_OTG_HCHIMASK_BABBLEM;
      }

      break;

    case EP_TYPE_ISOC:
      USBx_HC((uint32_t)ch_num)->HCHIMASK = USB_OTG_HCHIMASK_TSFCMPNM  |
                                            USB_OTG_HCHIMASK_RXTXACKM   |
                                            USB_OTG_HCHIMASK_AHBERRM |
                                            USB_OTG_HCHIMASK_FOVRM;

      if ((epnum & 0x80U) == 0x80U)
      {
        USBx_HC((uint32_t)ch_num)->HCHIMASK |= (USB_OTG_HCHIMASK_TERRM | USB_OTG_HCHIMASK_BABBLEM);
      }
      break;

    default:
      ret = DAL_ERROR;
      break;
  }

  /* Enable host channel Halt interrupt */
  USBx_HC((uint32_t)ch_num)->HCHIMASK |= USB_OTG_HCHIMASK_TSFCMPANM;

  /* Enable the top level host channel interrupt. */
  USBx_HOST->HACHIMASK |= 1UL << (ch_num & 0xFU);

  /* Make sure host channel interrupts are enabled. */
  USBx->GINTMASK |= USB_OTG_GINTMASK_HCHM;

  /* Program the HCCHAR register */
  if ((epnum & 0x80U) == 0x80U)
  {
    HCcharEpDir = (0x1U << 15) & USB_OTG_HCH_EDPDRT;
  }
  else
  {
    HCcharEpDir = 0U;
  }

