betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_ddl_usb.c
  HostCoreSpeed = USB_GetHostSpeed(USBx);

  /* LS device plugged to HUB */
  if ((speed == HPRT0_PRTSPD_LOW_SPEED) && (HostCoreSpeed != HPRT0_PRTSPD_LOW_SPEED))
  {
    HCcharLowSpeed = (0x1U << 17) & USB_OTG_HCH_LSDV;
  }
  else
  {
    HCcharLowSpeed = 0U;
  }

  USBx_HC((uint32_t)ch_num)->HCH = (((uint32_t)dev_address << 22) & USB_OTG_HCH_DVADDR) |
                                      ((((uint32_t)epnum & 0x7FU) << 11) & USB_OTG_HCH_EDPNUM) |
                                      (((uint32_t)ep_type << 18) & USB_OTG_HCH_EDPTYP) |
                                      ((uint32_t)mps & USB_OTG_HCH_MAXPSIZE) | HCcharEpDir | HCcharLowSpeed;

  if ((ep_type == EP_TYPE_INTR) || (ep_type == EP_TYPE_ISOC))
  {
    USBx_HC((uint32_t)ch_num)->HCH |= USB_OTG_HCH_ODDF;
  }

  return ret;
}

/**
  * @brief  Start a transfer over a host channel
  * @param  USBx  Selected device
  * @param  hc  pointer to host channel structure
  * @param  dma USB dma enabled or disabled
  *          This parameter can be one of these values:
  *           0 : DMA feature not used
  *           1 : DMA feature used
  * @retval DAL state
  */
DAL_StatusTypeDef USB_HC_StartXfer(USB_OTG_GlobalTypeDef *USBx, USB_OTG_HCTypeDef *hc, uint8_t dma)
{
  uint32_t USBx_BASE = (uint32_t)USBx;
  uint32_t ch_num = (uint32_t)hc->ch_num;
  __IO uint32_t tmpreg;
  uint8_t  is_oddframe;
  uint16_t len_words;
  uint16_t num_packets;
  uint16_t max_hc_pkt_count = 256U;

#if defined (USB_OTG_HS)
  if (USBx == USB_OTG_HS)
  {
    /* in DMA mode host Core automatically issues ping  in case of NYET/NAK */
    if (dma == 1U)
    {
      if ((hc->ep_type == EP_TYPE_CTRL) || (hc->ep_type == EP_TYPE_BULK))
      {
        USBx_HC((uint32_t)ch_num)->HCHIMASK &= ~(USB_OTG_HCHIMASK_RXNYETM |
                                                 USB_OTG_HCHIMASK_RXTXACKM |
                                                 USB_OTG_HCHIMASK_RXNAKM);
      }
    }
    else
    {
      if ((hc->speed == USBH_HS_SPEED) && (hc->do_ping == 1U))
      {
        (void)USB_DoPing(USBx, hc->ch_num);
        return DAL_OK;
      }
    }

  }
#endif /* defined (USB_OTG_HS) */

  /* Compute the expected number of packets associated to the transfer */
  if (hc->xfer_len > 0U)
  {
    num_packets = (uint16_t)((hc->xfer_len + hc->max_packet - 1U) / hc->max_packet);

    if (num_packets > max_hc_pkt_count)
    {
      num_packets = max_hc_pkt_count;
      hc->XferSize = (uint32_t)num_packets * hc->max_packet;
    }
  }
  else
  {
    num_packets = 1U;
  }

  /*
   * For IN channel HCTSIZ.XferSize is expected to be an integer multiple of
   * max_packet size.
   */
  if (hc->ep_is_in != 0U)
  {
    hc->XferSize = (uint32_t)num_packets * hc->max_packet;
  }
  else
  {
    hc->XferSize = hc->xfer_len;
  }

  /* Initialize the HCTSIZn register */
  USBx_HC(ch_num)->HCHTSIZE = (hc->XferSize & USB_OTG_HCHTSIZE_TSFSIZE) |
                            (((uint32_t)num_packets << 19) & USB_OTG_HCHTSIZE_PCKTCNT) |
                            (((uint32_t)hc->data_pid << 29) & USB_OTG_HCHTSIZE_DATAPID);

  if (dma != 0U)
  {
    /* xfer_buff MUST be 32-bits aligned */
    USBx_HC(ch_num)->HCHDMA = (uint32_t)hc->xfer_buff;
  }

  is_oddframe = (((uint32_t)USBx_HOST->HFIFM & 0x01U) != 0U) ? 0U : 1U;
  USBx_HC(ch_num)->HCH &= ~USB_OTG_HCH_ODDF;
  USBx_HC(ch_num)->HCH |= (uint32_t)is_oddframe << 29;

  /* Set host channel enable */
  tmpreg = USBx_HC(ch_num)->HCH;
  tmpreg &= ~USB_OTG_HCH_CHINT;

  /* make sure to set the correct ep direction */
  if (hc->ep_is_in != 0U)
  {
    tmpreg |= USB_OTG_HCH_EDPDRT;
  }
  else
  {
    tmpreg &= ~USB_OTG_HCH_EDPDRT;
  }
  tmpreg |= USB_OTG_HCH_CHEN;
  USBx_HC(ch_num)->HCH = tmpreg;

  if (dma != 0U) /* dma mode */
  {
    return DAL_OK;
  }

  if ((hc->ep_is_in == 0U) && (hc->xfer_len > 0U))
  {
    switch (hc->ep_type)
    {
      /* Non periodic transfer */
      case EP_TYPE_CTRL:
      case EP_TYPE_BULK:

        len_words = (uint16_t)((hc->xfer_len + 3U) / 4U);

        /* check if there is enough space in FIFO space */
        if (len_words > (USBx->GNPTXFQSTS & 0xFFFFU))
        {
          /* need to process data in nptxfempty interrupt */
          USBx->GINTMASK |= USB_OTG_GINTMASK_NPTXFEMM;
        }
        break;

      /* Periodic transfer */
      case EP_TYPE_INTR:
      case EP_TYPE_ISOC:
        len_words = (uint16_t)((hc->xfer_len + 3U) / 4U);
        /* check if there is enough space in FIFO space */
        if (len_words > (USBx_HOST->HPTXSTS & 0xFFFFU)) /* split the transfer */
        {
          /* need to process data in ptxfempty interrupt */
          USBx->GINTMASK |= USB_OTG_GINTMASK_PTXFEM;
        }
        break;

      default:
        break;
    }

    /* Write packet into the Tx FIFO. */
    (void)USB_WritePacket(USBx, hc->xfer_buff, hc->ch_num, (uint16_t)hc->xfer_len, 0);
  }

  return DAL_OK;
}

/**
  * @brief Read all host channel interrupts status
  * @param  USBx  Selected device
  * @retval DAL state
  */
uint32_t USB_HC_ReadInterrupt(USB_OTG_GlobalTypeDef *USBx)
{
  uint32_t USBx_BASE = (uint32_t)USBx;

  return ((USBx_HOST->HACHINT) & 0xFFFFU);
}

/**
  * @brief  Halt a host channel
  * @param  USBx  Selected device
  * @param  hc_num  Host Channel number
  *         This parameter can be a value from 1 to 15
  * @retval DAL state
  */
DAL_StatusTypeDef USB_HC_Halt(USB_OTG_GlobalTypeDef *USBx, uint8_t hc_num)
{
  uint32_t USBx_BASE = (uint32_t)USBx;
  uint32_t hcnum = (uint32_t)hc_num;
  __IO uint32_t count = 0U;
  uint32_t HcEpType = (USBx_HC(hcnum)->HCH & USB_OTG_HCH_EDPTYP) >> 18;
  uint32_t ChannelEna = (USBx_HC(hcnum)->HCH & USB_OTG_HCH_CHEN) >> 31;

  if (((USBx->GAHBCFG & USB_OTG_GAHBCFG_DMAEN) == USB_OTG_GAHBCFG_DMAEN) &&
      (ChannelEna == 0U))
  {
    return DAL_OK;
  }

  /* Check for space in the request queue to issue the halt. */
  if ((HcEpType == HCCHAR_CTRL) || (HcEpType == HCCHAR_BULK))
  {
    USBx_HC(hcnum)->HCH |= USB_OTG_HCH_CHINT;

    if ((USBx->GAHBCFG & USB_OTG_GAHBCFG_DMAEN) == 0U)
    {
      if ((USBx->GNPTXFQSTS & (0xFFU << 16)) == 0U)
      {
        USBx_HC(hcnum)->HCH &= ~USB_OTG_HCH_CHEN;
        USBx_HC(hcnum)->HCH |= USB_OTG_HCH_CHEN;
        do
        {
          count++;

          if (count > 1000U)
          {
            break;
          }
        } while ((USBx_HC(hcnum)->HCH & USB_OTG_HCH_CHEN) == USB_OTG_HCH_CHEN);
      }
      else
      {
        USBx_HC(hcnum)->HCH |= USB_OTG_HCH_CHEN;
      }
    }
  }
  else
  {
    USBx_HC(hcnum)->HCH |= USB_OTG_HCH_CHINT;

    if ((USBx_HOST->HPTXSTS & (0xFFU << 16)) == 0U)
    {
      USBx_HC(hcnum)->HCH &= ~USB_OTG_HCH_CHEN;
      USBx_HC(hcnum)->HCH |= USB_OTG_HCH_CHEN;
      do
      {
        count++;

        if (count > 1000U)
        {
          break;
        }
      } while ((USBx_HC(hcnum)->HCH & USB_OTG_HCH_CHEN) == USB_OTG_HCH_CHEN);
    }
    else
    {
      USBx_HC(hcnum)->HCH |= USB_OTG_HCH_CHEN;
    }
  }

  return DAL_OK;
}

/**
  * @brief  Initiate Do Ping protocol
  * @param  USBx  Selected device
  * @param  hc_num  Host Channel number
  *         This parameter can be a value from 1 to 15
  * @retval DAL state
  */
DAL_StatusTypeDef USB_DoPing(USB_OTG_GlobalTypeDef *USBx, uint8_t ch_num)
{
  uint32_t USBx_BASE = (uint32_t)USBx;
  uint32_t chnum = (uint32_t)ch_num;
  uint32_t num_packets = 1U;
  uint32_t tmpreg;

  USBx_HC(chnum)->HCHTSIZE = ((num_packets << 19) & USB_OTG_HCHTSIZE_PCKTCNT) |
                           USB_OTG_HCHTSIZE_DO_PING;

  /* Set host channel enable */
  tmpreg = USBx_HC(chnum)->HCH;
  tmpreg &= ~USB_OTG_HCH_CHINT;
  tmpreg |= USB_OTG_HCH_CHEN;
  USBx_HC(chnum)->HCH = tmpreg;

  return DAL_OK;
}

/**
  * @brief  Stop Host Core
  * @param  USBx  Selected device
  * @retval DAL state
  */
DAL_StatusTypeDef USB_StopHost(USB_OTG_GlobalTypeDef *USBx)
{
  DAL_StatusTypeDef ret = DAL_OK;
  uint32_t USBx_BASE = (uint32_t)USBx;
  __IO uint32_t count = 0U;
  uint32_t value;
  uint32_t i;

  (void)USB_DisableGlobalInt(USBx);

