betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_ddl_usb.c
  /* Flush USB FIFO */
  if (USB_FlushTxFifo(USBx, 0x10U) != DAL_OK) /* all Tx FIFOs */
  {
    ret = DAL_ERROR;
  }

  if (USB_FlushRxFifo(USBx) != DAL_OK)
  {
    ret = DAL_ERROR;
  }

  /* Flush out any leftover queued requests. */
  for (i = 0U; i <= 15U; i++)
  {
    value = USBx_HC(i)->HCH;
    value |=  USB_OTG_HCH_CHINT;
    value &= ~USB_OTG_HCH_CHEN;
    value &= ~USB_OTG_HCH_EDPDRT;
    USBx_HC(i)->HCH = value;
  }

  /* Halt all channels to put them into a known state. */
  for (i = 0U; i <= 15U; i++)
  {
    value = USBx_HC(i)->HCH;
    value |= USB_OTG_HCH_CHINT;
    value |= USB_OTG_HCH_CHEN;
    value &= ~USB_OTG_HCH_EDPDRT;
    USBx_HC(i)->HCH = value;

    do
    {
      count++;

      if (count > 1000U)
      {
        break;
      }
    } while ((USBx_HC(i)->HCH & USB_OTG_HCH_CHEN) == USB_OTG_HCH_CHEN);
  }

  /* Clear any pending Host interrupts */
  USBx_HOST->HACHINT = 0xFFFFFFFFU;
  USBx->GCINT = 0xFFFFFFFFU;

  (void)USB_EnableGlobalInt(USBx);

  return ret;
}

/**
  * @brief  USB_ActivateRemoteWakeup active remote wakeup signalling
  * @param  USBx Selected device
  * @retval DAL status
  */
DAL_StatusTypeDef USB_ActivateRemoteWakeup(USB_OTG_GlobalTypeDef *USBx)
{
  uint32_t USBx_BASE = (uint32_t)USBx;

  if ((USBx_DEVICE->DSTS & USB_OTG_DSTS_SUSSTS) == USB_OTG_DSTS_SUSSTS)
  {
    /* active Remote wakeup signalling */
    USBx_DEVICE->DCTRL |= USB_OTG_DCTRL_RWKUPS;
  }

  return DAL_OK;
}

/**
  * @brief  USB_DeActivateRemoteWakeup de-active remote wakeup signalling
  * @param  USBx Selected device
  * @retval DAL status
  */
DAL_StatusTypeDef USB_DeActivateRemoteWakeup(USB_OTG_GlobalTypeDef *USBx)
{
  uint32_t USBx_BASE = (uint32_t)USBx;

  /* active Remote wakeup signalling */
  USBx_DEVICE->DCTRL &= ~(USB_OTG_DCTRL_RWKUPS);

  return DAL_OK;
}
#endif /* USB_OTG_FS || USB_OTG_HS || USB_OTG_FS2 */


/**
  * @}
  */

/**
  * @}
  */
#endif /* USB_OTG_FS || USB_OTG_HS || USB_OTG_FS2 */
#endif /* DAL_PCD_MODULE_ENABLED || DAL_HCD_MODULE_ENABLED */

/**
  * @}
  */
